backend/spec/fixtures/xml/create_and_allocate_consignments_with_booking_code.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <soapenv:Body>
    <ns1:createAndAllocateConsignmentsWithBookingCode soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:ns1="urn:DeliveryManager/services">
      <consignments soapenc:arrayType="ns2:Consignment[1]" xsi:type="soapenc:Array" xmlns:ns2="urn:DeliveryManager/types" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
        <item xsi:type="ns2:Consignment">
          <alreadyPalletisedGoodsFlag xsi:type="xsd:boolean">false</alreadyPalletisedGoodsFlag>
          <fragileGoodsFlag xsi:type="xsd:boolean">false</fragileGoodsFlag>
          <hazardousGoodsFlag xsi:type="xsd:boolean">false</hazardousGoodsFlag>
          <liquidGoodsFlag xsi:type="xsd:boolean">false</liquidGoodsFlag>
          <moreThanOneMetreGoodsFlag xsi:type="xsd:boolean">false</moreThanOneMetreGoodsFlag>
          <moreThanTwentyFiveKgGoodsFlag xsi:type="xsd:boolean">false</moreThanTwentyFiveKgGoodsFlag>
          <twoManLiftFlag xsi:type="xsd:boolean">false</twoManLiftFlag>
          <consignmentLevelDetailsFlag xsi:type="xsd:boolean">false</consignmentLevelDetailsFlag>
          <consignmentValueCurrencyCode xsi:type="soapenc:string">USD</consignmentValueCurrencyCode>
          <consignmentValueCurrencyRate xsi:type="xsd:double">1.5</consignmentValueCurrencyRate>
          <consignmentValue xsi:type="xsd:double">1.2</consignmentValue>
          <consignmentWeight xsi:type="xsd:double">1.0</consignmentWeight>
          <maxDimension xsi:type="xsd:double">30.0</maxDimension>
          <orderNumber xsi:type="soapenc:string">order1</orderNumber>
          <parcelCount xsi:type="xsd:int">1</parcelCount>
          <parcels soapenc:arrayType="ns2:Parcel[1]" xsi:type="soapenc:Array">
                        <item xsi:type="ns2:Parcel">
              <dutyPaid xsi:type="xsd:double">0.0</dutyPaid>
              <reference xsi:type="soapenc:string">1</reference>
              <parcelDepth xsi:type="xsd:double">20.0</parcelDepth>
              <parcelHeight xsi:type="xsd:double">10.0</parcelHeight>
              <parcelValue xsi:type="xsd:double">1.2</parcelValue>
              <parcelWeight xsi:type="xsd:double">1.0</parcelWeight>
              <parcelWidth xsi:type="xsd:double">30.0</parcelWidth>
              <products soapenc:arrayType="ns2:Product[1]" xsi:type="soapenc:Array">
                              <item xsi:type="ns2:Product">
                  <countryOfOrigin xsi:type="soapenc:string">UK</countryOfOrigin>
                  <fabricContent xsi:type="soapenc:string">50% Cotton 50% Wool</fabricContent>
                  <harmonisedProductCode xsi:type="soapenc:string">CODE012</harmonisedProductCode>
                  <productCode xsi:type="soapenc:string">SKU-1</productCode>
                  <productDescription xsi:type="soapenc:string">Knitted</productDescription>
                  <productTypeDescription xsi:type="soapenc:string">Sweater</productTypeDescription>
                  <productQuantity xsi:type="xsd:long">5</productQuantity>
                  <totalProductValue xsi:type="xsd:double">23.17</totalProductValue>
                  <unitProductWeight xsi:type="xsd:double">0.2</unitProductWeight>
                </item>
                            </products>
            </item>
                      </parcels>
          <recipientAddress xsi:type="ns2:Address">
            <countryCode xsi:type="soapenc:string">GBR</countryCode>
            <line1 xsi:type="soapenc:string">10 Lovely &amp; Wonderful Street</line1>
            <line2 xsi:type="soapenc:string">Northwest</line2>
            <line3 xsi:type="soapenc:string">Herdon</line3>
            <postCode xsi:type="soapenc:string">35005</postCode>
            <type xsi:type="soapenc:string">Residential</type>
          </recipientAddress>
          <recipientContactPhone xsi:type="soapenc:string">123-456-7890</recipientContactPhone>
          <recipientEmail xsi:type="soapenc:string">john@doe.com</recipientEmail>
          <recipientName xsi:type="soapenc:string">John Doe</recipientName>

          <senderAddress xsi:type="ns2:Address">
            <countryCode xsi:type="soapenc:string">GBR</countryCode>
            <line1 xsi:type="soapenc:string">89a Shacklewelll Lane</line1>
            <line2 xsi:type="soapenc:string">London</line2>
            <postCode xsi:type="soapenc:string">E8 2EB</postCode>
          </senderAddress>
          <senderContactPhone xsi:type="soapenc:string" xsi:nil="true"/>
          <senderEmail xsi:type="soapenc:string" xsi:nil="true"/>
          <senderName xsi:type="soapenc:string">Wool And The Gang</senderName>
          <senderVatNumber xsi:type="soapenc:string" xsi:nil="true"/>
          <senderCode xsi:type="soapenc:string">DEFAULT</senderCode>
          <termsOfTradeCode xsi:type="soapenc:string">DDU</termsOfTradeCode>
        </item>
      </consignments>
      <bookingCode xsi:type="soapenc:string">PARCEL</bookingCode>
      <calculateTaxAndDuty xsi:type="soapenc:boolean">false</calculateTaxAndDuty>
    </ns1:createAndAllocateConsignmentsWithBookingCode>
  </soapenv:Body>
</soapenv:Envelope>
